package oracle_db_sql;

public class Entity_2 {
	/*
	 개념
	 실체, 객체라고 변역한다.
	 
	 엔티티를 다른 말로
	 정보를 저장할 수 있는 어떤 것
	 데이터베이스 내에서 변별 가능한 객체
	 정보가 저장될 수 있는 사람, 물건, 사건 그리고 개념등
	 
	 이라고 부르는데
	 
	 공통점은
	 - 사람, 장소, 물건, 사건, 개념등의 명사에 해당한다.
	 - 업무상 관리가 필요한 관심사에 해당한다.
	 - 저장이 되기 위한 어떤 것이다.
	 
	 요약:
	 	업무에 필요하고 유용한 정보를 저장하고 관리하기 위한 집합적인 것으로
	 	설명할 수 있다.
	 	
	 @엔티티의 특징
	 - 반드시 해당 업무에서 필요하고 관리하고자 하는 정보여야 한다.
	 - 유일한 식별자에 의해 식별이 가능해야 한다.
	 - 영속적으로 존재하는 인스턴스의 집합이어야 한다(한개가 아니라 2개 이상)
	 - 엔티티는 업무 프로세스에 의해 이용되어야 한다.
	 - 엔티티는 반드시 속성이 있어야 한다.
	 - 엔티티는 다른 엔티티와 최소 한개 이상의 관계가 있어야 한다.
	 
	 1. 업무에서 필요로 하는 정보
	 2. 식별이 가능해야함: 엔티티를 도출하는 경우에 각각의 업무적으로 의미를 가지는
	 인스턴스가 식별자에 의해 한 개씩만 존재하는지 검증해 보아야 한다.
	 두 개 이상의 엔티티를 대변하면 그 식별자는 잘못 설계된 것이다.
	 ex : 홍길동이라고 불렀는데 2사람을 구분할 수 있어야 한다.
	 
	 엔티티의 명명
	 1. 현업업무에서 사용하는 용어를 사용한다.
	 2. 가능하면 약어를 사용하지 않는다.
	 3. 단수명사를 사용한다.
	 4. 모든 엔티티에서 유일하게 이름이 부여되여야 한다.
	 5. 엔티티 생성 의미대로 이름을 부여한다 **
	 
	 */
	
	
}
